In [4]:
import pandas as pd
import numpy as np

In [5]:
frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'), 
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [6]:
frame

               b         d         e
Utah    0.377989 -1.036880  0.665076
Ohio    1.467418 -0.919650 -0.307064
Texas  -0.028728  0.096711  0.050461
Oregon  0.869714  0.867440  1.722219

In [12]:
#절대값
b = np.abs(frame)
b

               b         d         e
Utah    0.377989  1.036880  0.665076
Ohio    1.467418  0.919650  0.307064
Texas   0.028728  0.096711  0.050461
Oregon  0.869714  0.867440  1.722219

In [8]:
#람다 함수 이용: 최댓값 - 최솟값
f = lambda x: x.max() - x.min()

In [17]:
#각 컬럼에 한번씩만 수행해서 series로 출력
b.apply(f)

b    1.438690
d    0.940170
e    1.671758
dtype: float64

In [18]:
#각 '로우'에 한번씩만 수행해서 series로 출력
b.apply(f, axis='columns')

Utah      0.658892
Ohio      1.160354
Texas     0.067983
Oregon    0.854779
dtype: float64

In [ ]:
#Dataframe에 기본적으로 내장되어있는 메서드
#mean(): 평균값, sum(): 합
#이외에도 일반적인 통계는 Dataframe의 메서드로 존재한다.

In [19]:
b.sum()

b    2.743849
d    2.920681
e    2.744821
dtype: float64

In [28]:
#axis=1 == axis = 'column' 동일
b.sum(axis=1)

Utah      2.079945
Ohio      2.694133
Texas     0.175900
Oregon    3.459374
dtype: float64

In [20]:
b.mean()

b    0.685962
d    0.730170
e    0.686205
dtype: float64

In [22]:
b.mean(axis='columns')

Utah      0.693315
Ohio      0.898044
Texas     0.058633
Oregon    1.153125
dtype: float64

In [23]:
format = lambda x: '%.2f' % x

In [26]:
#series에 mapping하기 위해 applymap을 쓴다
frame.applymap(format)

            b      d      e
Utah     0.38  -1.04   0.67
Ohio     1.47  -0.92  -0.31
Texas   -0.03   0.10   0.05
Oregon   0.87   0.87   1.72

In [27]:
frame['e'].map(format)

Utah       0.67
Ohio      -0.31
Texas      0.05
Oregon     1.72
Name: e, dtype: object

In [ ]:
# 5.2.7 정렬과 순위

In [29]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [32]:
a = obj.sort_index()

In [38]:
a.dtype

dtype('int64')

In [34]:
a.astype('float')

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

In [39]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'], 
                     columns = ['d', 'a', 'b', 'c'] )

In [40]:
# 로우로 정렬
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [41]:
# 컬럼으로 정렬
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [42]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [45]:
obj = pd.Series([4,7,-3,2])

obj

0    4
1    7
2   -3
3    2
dtype: int64

In [44]:
#객체를 값에 따라 정렬
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [46]:
# 
frame = pd.DataFrame({'b': [4,7,-3,2], 'a': [0, 1, 0, 1]})

In [47]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [48]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [49]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [50]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [51]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [52]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [53]:
# 동률인 경우 그룹 내에서 높은 순위를 적용한다.
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [58]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a':[0,1,0,1], 'c': [-2,5,8,-2.5]})

In [59]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [60]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [ ]:
# 5.2.8 중복 색인

In [61]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [62]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [63]:
obj.index.is_unique

False

In [64]:
obj['a']

a    0
a    1
dtype: int64

In [65]:
obj['c']

4

In [66]:
df = pd.DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])

In [67]:
df

          0         1         2
a  1.072739 -0.520945  0.686418
a -1.137180  2.662427 -1.007120
b  0.533341  1.807569  0.462293
b -1.331159  0.412263 -0.410768

In [68]:
df.loc['b']

          0         1         2
b  0.533341  1.807569  0.462293
b -1.331159  0.412263 -0.410768

In [ ]:
#5.3.2 유일갓, 값세기, 멤버십

In [69]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [70]:
uniques = obj.unique()

In [71]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [73]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [74]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [75]:
mask = obj.isin(['b', 'c'])

In [76]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [77]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [ ]:
# isin: Series의 각 원소가 넘겨받은 연속된 '값'에 속하는 지 나타내는 '불리언 배열'을 반환
# match: 각 값에 대해 유일한 값을 담고 있는 배열에서의 정수 색인을 계산. 
#        데이터 정렬이나 조인형태의 연산을 하는 경우에 유용하다
# unique: Series에서 중복되는 값을 제거하고, 유일값만 포함하는 배열을 반환한다.
#         결과는 Series에서 발견된 순서대로 순환
#value_counts: Series에서 유일값에 대한 색인과 도수를 계산한다. 도수는 내림차순으로 정렬된다.

In [78]:
data = pd.DataFrame({'Qu1': [1,3,4,3,4],
                     'Qu2': [2,3,1,2,3],
                     'Qu3': [1,5,2,4,4]})

In [79]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [83]:
data.isin([1,2])

     Qu1    Qu2    Qu3
0   True   True   True
1  False  False  False
2  False   True   True
3  False   True  False
4  False  False  False